app/controllers/posts_controller.rb

  def new
    @post = Post.new
    if params[:author_id] && !Author.exists?(params[:author_id])
---
SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"

  def index
    # @posts = Post.all
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
    else
      @posts = Post.all
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"